package oop;

public class Human {

    //Task1.1-1.2

    String name;
    String town;
    String jobTitle;
    int yearOfBirth;

    Human(String name) {
        this.name = name;
    }


    void Human() {
        System.out.println("Привет! Меня зовут " + name + " Я из города " + town + " Я родился(-лась) в "
                + yearOfBirth + " году. Я работаю на должности " + jobTitle + ". Будем знакомы!");
    }
}


//Продолжим работать с классом human.
//Дополните созданные ранее конструкторы проверками, которые позволяют проверить,
// что год рождения не может быть отрицательным, или ставят значение по умолчанию, равное нулю.
//Если не указано имя, город проживания или должность, то есть передана пустая строка
// или null, то программа должна подставить значение «Информация не указана» при выводе в консоль.